scripts/exp2/redis-sls-1000-05.txt
====== PING_INLINE ======
  100000 requests completed in 2.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.4 milliseconds
0.06% <= 0.5 milliseconds
4.94% <= 0.6 milliseconds
42.94% <= 0.7 milliseconds
87.30% <= 0.8 milliseconds
98.85% <= 0.9 milliseconds
99.76% <= 1.0 milliseconds
99.82% <= 1.1 milliseconds
99.83% <= 1.2 milliseconds
99.84% <= 1.3 milliseconds
99.85% <= 1.4 milliseconds
99.85% <= 1.5 milliseconds
99.86% <= 1.6 milliseconds
99.86% <= 1.7 milliseconds
99.87% <= 1.8 milliseconds
99.88% <= 1.9 milliseconds
99.89% <= 2.0 milliseconds
99.89% <= 2 milliseconds
99.90% <= 4 milliseconds
99.95% <= 5 milliseconds
100.00% <= 5 milliseconds
37893.14 requests per second

====== PING_BULK ======
  100000 requests completed in 2.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.36% <= 1 milliseconds
99.68% <= 2 milliseconds
99.77% <= 3 milliseconds
99.82% <= 4 milliseconds
99.84% <= 5 milliseconds
99.85% <= 6 milliseconds
99.85% <= 14 milliseconds
99.95% <= 15 milliseconds
100.00% <= 15 milliseconds
37257.82 requests per second

====== SET ======
  100000 requests completed in 2.64 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.78% <= 1 milliseconds
99.88% <= 2 milliseconds
99.90% <= 4 milliseconds
99.97% <= 5 milliseconds
100.00% <= 5 milliseconds
37850.11 requests per second

====== GET ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.39% <= 1 milliseconds
99.71% <= 2 milliseconds
99.75% <= 3 milliseconds
99.78% <= 4 milliseconds
99.89% <= 5 milliseconds
99.95% <= 6 milliseconds
99.95% <= 8 milliseconds
99.95% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 15 milliseconds
37664.79 requests per second

====== INCR ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.66% <= 1 milliseconds
99.82% <= 2 milliseconds
99.85% <= 3 milliseconds
99.85% <= 4 milliseconds
99.91% <= 5 milliseconds
99.95% <= 14 milliseconds
99.97% <= 15 milliseconds
100.00% <= 15 milliseconds
37764.35 requests per second

====== LPUSH ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.36% <= 1 milliseconds
99.71% <= 2 milliseconds
99.83% <= 3 milliseconds
99.88% <= 4 milliseconds
99.92% <= 5 milliseconds
99.95% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 15 milliseconds
37383.18 requests per second

====== RPUSH ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.52% <= 1 milliseconds
99.77% <= 2 milliseconds
99.85% <= 4 milliseconds
99.96% <= 5 milliseconds
100.00% <= 5 milliseconds
37495.31 requests per second

====== LPOP ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.29% <= 1 milliseconds
99.66% <= 2 milliseconds
99.79% <= 3 milliseconds
99.83% <= 4 milliseconds
99.91% <= 5 milliseconds
100.00% <= 5 milliseconds
37608.12 requests per second

====== RPOP ======
  100000 requests completed in 2.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.55% <= 1 milliseconds
99.81% <= 2 milliseconds
99.89% <= 3 milliseconds
99.90% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 5 milliseconds
37979.49 requests per second

====== SADD ======
  100000 requests completed in 2.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.43% <= 1 milliseconds
99.71% <= 2 milliseconds
99.79% <= 3 milliseconds
99.82% <= 4 milliseconds
99.91% <= 5 milliseconds
100.00% <= 5 milliseconds
38037.28 requests per second

====== HSET ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.39% <= 1 milliseconds
99.63% <= 2 milliseconds
99.79% <= 3 milliseconds
99.83% <= 4 milliseconds
99.94% <= 5 milliseconds
100.00% <= 5 milliseconds
37664.79 requests per second

====== SPOP ======
  100000 requests completed in 2.93 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

96.46% <= 1 milliseconds
99.75% <= 2 milliseconds
99.83% <= 3 milliseconds
99.85% <= 4 milliseconds
99.87% <= 5 milliseconds
99.90% <= 11 milliseconds
99.93% <= 12 milliseconds
100.00% <= 13 milliseconds
100.00% <= 13 milliseconds
34083.16 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 2.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.75% <= 1 milliseconds
99.73% <= 2 milliseconds
99.93% <= 3 milliseconds
99.96% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
36284.47 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.28 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

94.68% <= 1 milliseconds
99.62% <= 2 milliseconds
99.78% <= 3 milliseconds
99.82% <= 4 milliseconds
99.85% <= 11 milliseconds
99.87% <= 12 milliseconds
99.97% <= 13 milliseconds
100.00% <= 13 milliseconds
30525.03 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
99.41% <= 2 milliseconds
99.61% <= 3 milliseconds
99.80% <= 4 milliseconds
99.89% <= 5 milliseconds
99.95% <= 6 milliseconds
99.95% <= 7 milliseconds
99.95% <= 11 milliseconds
99.96% <= 12 milliseconds
99.98% <= 13 milliseconds
100.00% <= 14 milliseconds
100.00% <= 14 milliseconds
18601.19 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.01 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
98.80% <= 2 milliseconds
99.53% <= 3 milliseconds
99.67% <= 4 milliseconds
99.75% <= 5 milliseconds
99.81% <= 6 milliseconds
99.86% <= 7 milliseconds
99.88% <= 8 milliseconds
99.89% <= 9 milliseconds
99.90% <= 10 milliseconds
99.90% <= 12 milliseconds
99.93% <= 13 milliseconds
99.96% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
14261.27 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
62.22% <= 2 milliseconds
99.91% <= 3 milliseconds
99.97% <= 4 milliseconds
99.97% <= 5 milliseconds
99.98% <= 6 milliseconds
99.99% <= 7 milliseconds
100.00% <= 7 milliseconds
12669.45 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.67 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.66% <= 1 milliseconds
99.90% <= 2 milliseconds
99.94% <= 3 milliseconds
99.97% <= 4 milliseconds
100.00% <= 5 milliseconds
100.00% <= 5 milliseconds
37481.26 requests per second