scripts/exp2/redis-sls-20-07.txt
====== PING_INLINE ======
  100000 requests completed in 7.79 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 0.3 milliseconds
0.73% <= 0.4 milliseconds
5.51% <= 0.5 milliseconds
15.67% <= 0.6 milliseconds
29.30% <= 0.7 milliseconds
43.41% <= 0.8 milliseconds
55.02% <= 0.9 milliseconds
59.88% <= 1.0 milliseconds
60.72% <= 1.1 milliseconds
61.00% <= 1.2 milliseconds
61.67% <= 1.3 milliseconds
62.93% <= 1.4 milliseconds
64.28% <= 1.5 milliseconds
65.74% <= 1.6 milliseconds
67.19% <= 1.7 milliseconds
68.66% <= 1.8 milliseconds
70.12% <= 1.9 milliseconds
71.57% <= 2.0 milliseconds
73.03% <= 2.1 milliseconds
73.03% <= 2 milliseconds
80.46% <= 3 milliseconds
80.51% <= 4 milliseconds
80.55% <= 5 milliseconds
80.57% <= 6 milliseconds
80.98% <= 7 milliseconds
83.41% <= 8 milliseconds
83.55% <= 9 milliseconds
83.77% <= 10 milliseconds
84.17% <= 11 milliseconds
90.74% <= 12 milliseconds
96.71% <= 13 milliseconds
96.90% <= 14 milliseconds
96.91% <= 15 milliseconds
96.95% <= 16 milliseconds
96.95% <= 17 milliseconds
96.98% <= 18 milliseconds
97.00% <= 19 milliseconds
97.00% <= 20 milliseconds
97.35% <= 21 milliseconds
98.64% <= 22 milliseconds
99.92% <= 23 milliseconds
100.00% <= 23 milliseconds
12840.27 requests per second

====== PING_BULK ======
  100000 requests completed in 7.49 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

61.08% <= 1 milliseconds
72.62% <= 2 milliseconds
81.18% <= 3 milliseconds
81.25% <= 6 milliseconds
81.46% <= 7 milliseconds
83.10% <= 8 milliseconds
83.28% <= 9 milliseconds
83.38% <= 10 milliseconds
83.92% <= 11 milliseconds
91.30% <= 12 milliseconds
97.87% <= 13 milliseconds
98.05% <= 19 milliseconds
98.05% <= 20 milliseconds
98.30% <= 21 milliseconds
99.18% <= 22 milliseconds
99.96% <= 23 milliseconds
100.00% <= 23 milliseconds
13347.57 requests per second

====== SET ======
  100000 requests completed in 7.69 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

59.79% <= 1 milliseconds
72.00% <= 2 milliseconds
80.75% <= 3 milliseconds
80.79% <= 4 milliseconds
80.79% <= 6 milliseconds
80.95% <= 7 milliseconds
83.08% <= 8 milliseconds
83.19% <= 9 milliseconds
83.28% <= 10 milliseconds
83.76% <= 11 milliseconds
90.64% <= 12 milliseconds
97.39% <= 13 milliseconds
97.65% <= 20 milliseconds
97.79% <= 21 milliseconds
98.99% <= 22 milliseconds
100.00% <= 22 milliseconds
13005.59 requests per second

====== GET ======
  100000 requests completed in 7.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

59.58% <= 1 milliseconds
72.57% <= 2 milliseconds
80.88% <= 3 milliseconds
80.90% <= 6 milliseconds
81.60% <= 7 milliseconds
83.31% <= 8 milliseconds
83.37% <= 9 milliseconds
83.60% <= 10 milliseconds
84.40% <= 11 milliseconds
90.55% <= 12 milliseconds
97.05% <= 13 milliseconds
97.36% <= 14 milliseconds
97.40% <= 16 milliseconds
97.43% <= 17 milliseconds
97.45% <= 19 milliseconds
97.46% <= 20 milliseconds
97.65% <= 21 milliseconds
98.90% <= 22 milliseconds
99.95% <= 23 milliseconds
100.00% <= 23 milliseconds
13065.06 requests per second

====== INCR ======
  100000 requests completed in 7.52 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

60.17% <= 1 milliseconds
73.12% <= 2 milliseconds
81.20% <= 3 milliseconds
81.20% <= 5 milliseconds
81.22% <= 6 milliseconds
81.95% <= 7 milliseconds
83.45% <= 8 milliseconds
83.51% <= 9 milliseconds
83.83% <= 10 milliseconds
84.61% <= 11 milliseconds
90.99% <= 12 milliseconds
97.44% <= 13 milliseconds
97.70% <= 20 milliseconds
97.72% <= 21 milliseconds
98.79% <= 22 milliseconds
99.94% <= 23 milliseconds
100.00% <= 23 milliseconds
13292.57 requests per second

====== LPUSH ======
  100000 requests completed in 9.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

44.69% <= 1 milliseconds
65.80% <= 2 milliseconds
77.66% <= 3 milliseconds
77.74% <= 4 milliseconds
77.82% <= 5 milliseconds
78.09% <= 6 milliseconds
79.00% <= 7 milliseconds
79.60% <= 8 milliseconds
79.65% <= 9 milliseconds
79.82% <= 10 milliseconds
80.29% <= 11 milliseconds
85.32% <= 12 milliseconds
92.90% <= 13 milliseconds
93.39% <= 14 milliseconds
93.45% <= 15 milliseconds
94.04% <= 16 milliseconds
95.44% <= 17 milliseconds
96.46% <= 18 milliseconds
96.60% <= 19 milliseconds
96.70% <= 20 milliseconds
96.83% <= 21 milliseconds
97.74% <= 22 milliseconds
99.41% <= 23 milliseconds
99.95% <= 24 milliseconds
100.00% <= 25 milliseconds
100.00% <= 25 milliseconds
10869.57 requests per second

====== RPUSH ======
  100000 requests completed in 4.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

82.75% <= 1 milliseconds
89.10% <= 2 milliseconds
93.24% <= 3 milliseconds
93.32% <= 4 milliseconds
93.56% <= 5 milliseconds
93.72% <= 6 milliseconds
93.82% <= 7 milliseconds
93.85% <= 8 milliseconds
93.91% <= 9 milliseconds
94.12% <= 10 milliseconds
94.28% <= 11 milliseconds
94.96% <= 12 milliseconds
95.93% <= 13 milliseconds
96.05% <= 14 milliseconds
96.36% <= 15 milliseconds
96.84% <= 16 milliseconds
97.92% <= 17 milliseconds
98.40% <= 18 milliseconds
98.40% <= 21 milliseconds
98.80% <= 22 milliseconds
99.74% <= 23 milliseconds
99.97% <= 24 milliseconds
99.98% <= 25 milliseconds
100.00% <= 25 milliseconds
20618.56 requests per second

====== LPOP ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.62% <= 1 milliseconds
99.88% <= 2 milliseconds
99.90% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 4 milliseconds
37551.63 requests per second

====== RPOP ======
  100000 requests completed in 2.62 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.92% <= 1 milliseconds
100.00% <= 1 milliseconds
38109.75 requests per second

====== SADD ======
  100000 requests completed in 2.68 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.74% <= 1 milliseconds
99.92% <= 2 milliseconds
99.94% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 5 milliseconds
100.00% <= 6 milliseconds
100.00% <= 6 milliseconds
37285.61 requests per second

====== HSET ======
  100000 requests completed in 2.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.86% <= 1 milliseconds
100.00% <= 1 milliseconds
37579.86 requests per second

====== SPOP ======
  100000 requests completed in 2.65 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.63% <= 1 milliseconds
99.92% <= 2 milliseconds
99.97% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 4 milliseconds
37750.09 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 3.07 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

92.69% <= 1 milliseconds
99.85% <= 2 milliseconds
99.92% <= 3 milliseconds
99.96% <= 4 milliseconds
100.00% <= 5 milliseconds
32626.43 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 3.42 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

79.46% <= 1 milliseconds
100.00% <= 2 milliseconds
100.00% <= 2 milliseconds
29248.32 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.43 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
99.86% <= 2 milliseconds
99.92% <= 3 milliseconds
99.97% <= 4 milliseconds
99.99% <= 5 milliseconds
100.00% <= 6 milliseconds
18419.60 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 7.05 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
98.14% <= 2 milliseconds
99.88% <= 3 milliseconds
99.92% <= 4 milliseconds
99.96% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 6 milliseconds
14188.42 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 7.97 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
53.36% <= 2 milliseconds
99.92% <= 3 milliseconds
99.96% <= 4 milliseconds
99.97% <= 5 milliseconds
99.98% <= 6 milliseconds
100.00% <= 7 milliseconds
100.00% <= 7 milliseconds
12551.78 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 2.91 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

93.81% <= 1 milliseconds
99.88% <= 2 milliseconds
99.93% <= 3 milliseconds
99.99% <= 4 milliseconds
100.00% <= 4 milliseconds
34328.87 requests per second